# Import Libraries

In [660]:
import warnings
warnings.filterwarnings('ignore')

In [661]:
import csv
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [662]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score, log_loss, confusion_matrix
from sklearn.preprocessing import MinMaxScaler
from sklearn.metrics import r2_score

# Dataset

In [663]:
allen1 = pd.read_csv("Dataset1.csv")
allen3 = pd.read_csv("Dataset2.csv")

In [664]:
allen1.head()

,S.No,company,Age,Gender,Qualification,no of experience in years,Area of work,salary package per month
0,1,ABBB,21,M,B.E,0,programming,30000
1,2,ABBB,24,F,M.E,1,predective analysis,50000
2,3,ABBB,30,M,M.E,5,cloud server management,120000
3,4,ABBB,23,M,B.E,2,programming,42000
4,5,ABBB,21,F,B.E,0,predective analysis,35000

In [665]:
allen3.head()

,S.No,person,Age,Gender,Qualification,no of experience in years,Area of work,salary package per month
0,NaN,Bobby,22,F,B.E,1,programming,NaN
1,NaN,Rahul,28,M,B.E,5,predictive analysis,NaN
2,NaN,Jhanvi,30,F,M.E,4,cloud server management,NaN
3,NaN,Sanjay,35,M,M.E,9,predictive analysis,NaN
4,NaN,sukruti,29,F,M.E,5,cloud server management,NaN

In [666]:
allen1.describe()

,S.No,Age,no of experience in years,salary package per month
count,52.000000,52.000000,52.000000,52.000000
mean,26.500000,27.788462,4.980769,87769.230769
std,15.154757,6.347260,6.027682,97667.024436
min,1.000000,21.000000,0.000000,20000.000000
25%,13.750000,22.000000,0.750000,25000.000000
50%,26.500000,26.000000,2.000000,39500.000000
75%,39.250000,31.250000,8.250000,112500.000000
max,52.000000,43.000000,21.000000,500000.000000

In [667]:
allen3.describe()

       S.No       Age   no of experience in years  salary package per month
count   0.0   8.000000                   8.000000                       0.0
mean    NaN  27.625000                   4.375000                       NaN
std     NaN   3.961872                   2.559994                       NaN
min     NaN  22.000000                   1.000000                       NaN
25%     NaN  25.500000                   3.250000                       NaN
50%     NaN  27.500000                   5.000000                       NaN
75%     NaN  29.250000                   5.000000                       NaN
max     NaN  35.000000                   9.000000                       NaN